Revit 2026 API

# GeomCombinationSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public GeomCombinationSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
GeomCombinationSetIterator()
```
```fsharp
new : unit -> GeomCombinationSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

GeomCombinationSetIterator Class

Autodesk.Revit.DB Namespace